In [2]:
import pandas as pd
import numpy as np
import pymysql
from sqlalchemy import create_engine

In [3]:
# Establishing the connction with mySQL

import getpass  
password = getpass.getpass()

········

In [120]:
sd = "sakila"  # the database
connection_string = 'mysql+pymysql://root:' + password + '@localhost/'+ sd 
engine = create_engine(connection_string)
engine

Engine(mysql+pymysql://root:***@localhost/sakila)

In [5]:
from sqlalchemy import text

In [121]:
def rentals_month(engine, month, year):
    
    with engine.connect() as connection:
        query = text(
            """SELECT *, MONTH(rental_date) AS month, YEAR(rental_date) AS year FROM rental
            WHERE MONTH(rental_date) = :month AND YEAR(rental_date) = :year;"""
        )
        result = connection.execute(query, {"month": month, "year": year}).fetchall()
        df = pd.DataFrame(result)
    
    return df

In [206]:
df = rentals_month(engine, month=6, year=2005)
df

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,month,year
0,1158,2005-06-14 22:53:33,1632,416,2005-06-18 21:37:33,2,2006-02-15 21:30:53,6,2005
1,1159,2005-06-14 22:55:13,4395,516,2005-06-17 02:11:13,1,2006-02-15 21:30:53,6,2005
2,1160,2005-06-14 23:00:34,2795,239,2005-06-18 01:58:34,2,2006-02-15 21:30:53,6,2005
3,1161,2005-06-14 23:07:08,1690,285,2005-06-21 17:12:08,1,2006-02-15 21:30:53,6,2005
4,1162,2005-06-14 23:09:38,987,310,2005-06-23 22:00:38,1,2006-02-15 21:30:53,6,2005
...,...,...,...,...,...,...,...,...,...
2306,3465,2005-06-21 22:10:01,1488,510,2005-06-30 21:35:01,1,2006-02-15 21:30:53,6,2005
2307,3466,2005-06-21 22:13:33,371,226,2005-06-25 21:01:33,2,2006-02-15 21:30:53,6,2005
2308,3467,2005-06-21 22:19:25,729,543,2005-06-27 00:03:25,2,2006-02-15 21:30:53,6,2005
2309,3468,2005-06-21 22:43:45,2899,100,2005-06-30 01:49:45,1,2006-02-15 21:30:53,6,2005
2310,3469,2005-06-21 22:48:59,4087,181,2005-06-28 19:32:59,1,2006-02-15 21:30:53,6,2005

In [188]:
def rental_count_month(df, month, year):
    
    df = rentals_month(engine, month, year)
    new_df = df.groupby("customer_id").agg({"rental_id" : ["count"]})
    new_df.rename(columns = {"rental_id" : f"rentals_{month}_{year}"}, inplace=True)
    
    return new_df

In [205]:
new_df = rental_count_month(df, month = 7, year = 2005)
new_df

            rentals_7_2005
                     count
customer_id
1                       12
2                       14
3                       13
4                        5
5                       16
...                    ...
595                     19
596                      6
597                      7
598                     16
599                      7

[599 rows x 1 columns]

In [207]:
def compare_rentals(df, new_df, engine, month1, year1, month2, year2):
    
    df = rentals_month(engine, month1, year1)
    new_df = rental_count_month(df, month2, year2)
    
    df = df.groupby("customer_id").size().reset_index(name = f"rentals_{month1}_{year1}")
    new_df.columns = [f"rentals_{month2}_{year2}"]
    
    df_tot = pd.concat([df, new_df], axis=1)
    df_tot["difference"] = df_tot[f"rentals_{month1}_{year1}"] - df_tot[f"rentals_{month2}_{year2}"]
    
    return df_tot

In [208]:
df_tot = compare_rentals(df, new_df, engine, month1=5, year1=2005, month2=7, year2=2005 )
df_tot

     customer_id  rentals_5_2005  rentals_7_2005  difference
0            1.0             2.0             NaN         NaN
1            2.0             1.0            12.0       -11.0
2            3.0             2.0            14.0       -12.0
3            5.0             3.0            13.0       -10.0
4            6.0             3.0             5.0        -2.0
..           ...             ...             ...         ...
595          NaN             NaN            19.0         NaN
596          NaN             NaN             6.0         NaN
597          NaN             NaN             7.0         NaN
598          NaN             NaN            16.0         NaN
599          NaN             NaN             7.0         NaN

[600 rows x 4 columns]